DataProcessors/АвтоматическаяУстановкаКонсернов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<DataProcessor>		<InternalInfo>			<xr:GeneratedType name="DataProcessorObject.јвтоматическа€”становка онсернов" category="Object">				<xr:TypeId>977e7f1d-f1c6-4ed4-bee4-ae3a2f07ff9d</xr:TypeId>				<xr:ValueId>cec6c659-9d61-40d1-868a-9658a7278dd0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DataProcessorManager.јвтоматическа€”становка онсернов" category="Manager">				<xr:TypeId>f2fd2b91-ba65-4cf6-a45a-c16ddb26570c</xr:TypeId>				<xr:ValueId>34e3fb98-5dc1-4589-bbbf-d78876ce2a41</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>јвтоматическа€”становка онсернов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>јвтоматическа€ установка консернов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Ётоќбработкаќбменаƒанными</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ёто обработка обмена данными</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>1</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>				</Properties>			</Attribute>		</ChildObjects>	</DataProcessor></MetaDataObject>

InformationRegisters/ПравилаАвтоматическойУстановкиКонсернов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ПравилаАвтоматическойУстановкиКонсернов" category="Record">				<xr:TypeId>570efeb3-19f1-4a89-a9f2-dd3b17431d97</xr:TypeId>				<xr:ValueId>3abd352f-7836-4966-9819-3456658f1814</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ПравилаАвтоматическойУстановкиКонсернов" category="Manager">				<xr:TypeId>ac2d45f9-ddfe-4e14-ab6a-0f4a58ac0092</xr:TypeId>				<xr:ValueId>91bd1057-029b-411b-81bd-f4e9d56ffdac</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ПравилаАвтоматическойУстановкиКонсернов" category="Selection">				<xr:TypeId>1409bba3-1fee-4abc-8425-b1e6d6c46338</xr:TypeId>				<xr:ValueId>3adb19af-6361-45d0-b566-33659fd92381</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ПравилаАвтоматическойУстановкиКонсернов" category="List">				<xr:TypeId>06e03667-1583-4747-acc6-12b153e42b8f</xr:TypeId>				<xr:ValueId>e7a5ec7e-d314-4f61-8b72-42560471ae7d</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ПравилаАвтоматическойУстановкиКонсернов" category="RecordSet">				<xr:TypeId>0b5d8bb6-2ae6-49b0-89a4-e44172016456</xr:TypeId>				<xr:ValueId>2862e723-34df-4efc-9010-acd529279857</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ПравилаАвтоматическойУстановкиКонсернов" category="RecordKey">				<xr:TypeId>28abecb5-25b8-4e00-8b98-ed7328c87f73</xr:TypeId>				<xr:ValueId>d11f56bf-79e0-4226-b1ef-8cffce0692bc</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ПравилаАвтоматическойУстановкиКонсернов" category="RecordManager">				<xr:TypeId>ff8deecf-7170-4e76-82bc-9faec82d355e</xr:TypeId>				<xr:ValueId>2c0b333e-88fa-4ca3-8964-ef79b58865f2</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ПравилаАвтоматическойУстановкиКонсернов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Правила автоматической установки консернов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>			<WriteMode>RecorderSubordinate</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Действует</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Действует</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:boolean</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Правило</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Правило</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:DocumentRef.ПравилоАвтоматическойУстановкиКонсернов</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ТочкаРегистрацииMES</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Точка регистрации MES</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ПервыйЗаказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Первый заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ПоследнийЗаказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Последний заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

Enums/ВидыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Enum>		<InternalInfo>			<xr:GeneratedType name="EnumRef.ВидыОбмена" category="Ref">				<xr:TypeId>4487d272-d03b-409f-a536-c817da285942</xr:TypeId>				<xr:ValueId>a02e7e82-fbcd-4a24-8c6e-c35fa9c989ce</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumManager.ВидыОбмена" category="Manager">				<xr:TypeId>c6364b6b-450f-4fbd-9643-f6f2e4117404</xr:TypeId>				<xr:ValueId>8c25b0e9-d171-40a7-8704-00dbce0998d4</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="EnumList.ВидыОбмена" category="List">				<xr:TypeId>716a692d-eb6d-4870-8cf2-91c1583d4b98</xr:TypeId>				<xr:ValueId>a34896af-fd1c-43a9-a7bd-c806973169f7</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ВидыОбмена</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Виды обмена</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>false</UseStandardCommands>			<StandardAttributes>				<xr:StandardAttribute name="Order">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Ref">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<Characteristics/>			<QuickChoice>true</QuickChoice>			<ChoiceMode>BothWays</ChoiceMode>			<DefaultListForm/>			<DefaultChoiceForm/>			<AuxiliaryListForm/>			<AuxiliaryChoiceForm/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>		</Properties>		<ChildObjects>			<EnumValue>				<Properties>					<Name>Загрузка</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Загрузка</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>Выгрузка</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Выгрузка</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>			<EnumValue>				<Properties>					<Name>Двунаправленный</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Двунаправленный</v8:content>						</v8:item>					</Synonym>					<Comment/>				</Properties>			</EnumValue>		</ChildObjects>	</Enum></MetaDataObject>

DataProcessors/АвтоматическаяУстановкаКонсернов/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеОбработкиОбмена() Экспорт
	
	// полный состав параметров описания смотри в этой функции
	СтруктураНастроек = Справочники.НетиповыеОбменыДанными.ПолучитьОписаниеОбработкиОбменаПоУмолчанию();
	
	СтруктураНастроек.ТекстовоеОписаниеОбмена = НСтр("ru='Автоматическая установка консернов'");
	СтруктураНастроек.ВидОбмена = Перечисления.ВидыОбмена.Двунаправленный;
	СтруктураНастроек.СпособПередачиДанных = Перечисления.СпособыПередачиДанныхВНетиповыхОбменах.None;
	СтруктураНастроек.XML_НастройкаОбязательна = Ложь;
	СтруктураНастроек.XML_НастройкаОбязательна = Ложь;
	СтруктураНастроек.ИспользованиеРегламентогоЗадания = Истина;
	СтруктураНастроек.ИспользованиеРегистрацииДанныхНаУзлеНетиповогоОбмена = Истина;
	
	Возврат СтруктураНастроек;
	
КонецФункции 

Функция ВыполнитьОбмен(Событие, НастройкаОбмена) Экспорт
	
	ТекстСообщения = "";
	СписокВыгруженыхОбъектов = Новый СписокЗначений;
	КоличествоКонсернов = 0;
	
	Если Не ЗначениеЗаполнено(НастройкаОбмена.УзелРегистрацииИзменений) Тогда
		ТекстСообщения = НСтр("ru='Узел регистрации изменений не заполнен.';en='Node of registration of changes is not filled.'");	
		РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие, 
			Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка,
			ТекстСообщения);	
		Возврат ТекстСообщения;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеПоКонвейеруИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Регистрация
		|ИЗ
		|	Документ.ДвижениеПоКонвейеру.Изменения КАК ДвижениеПоКонвейеруИзменения
		|ГДЕ
		|	ДвижениеПоКонвейеруИзменения.Узел = &Узел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистрация.Ссылка КАК Ссылка,
		|	ДвижениеПоКонвейеру.Заказ КАК Заказ,
		|	ДвижениеПоКонвейеру.ТочкаРегистрации КАК ТочкаРегистрации
		|ПОМЕСТИТЬ ВТ_ДвиженияПоКонвейеру
		|ИЗ
		|	ВТ_Регистрация КАК ВТ_Регистрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПоКонвейеру КАК ДвижениеПоКонвейеру
		|		ПО ВТ_Регистрация.Ссылка = ДвижениеПоКонвейеру.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПоКонвейеру.Ссылка КАК ДвижениеПоКонвейеру,
		|	ПравилаАвтоматическойУстановкиКонсерновСрезПоследних.Правило КАК Правило,
		|	ВТ_ДвиженияПоКонвейеру.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ЗаказыИПравила
		|ИЗ
		|	ВТ_ДвиженияПоКонвейеру КАК ВТ_ДвиженияПоКонвейеру
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаАвтоматическойУстановкиКонсернов.СрезПоследних(
		|				,
		|				ТочкаРегистрацииMES В
		|					(ВЫБРАТЬ
		|						ВТ_ДвиженияПоКонвейеру.ТочкаРегистрации
		|					ИЗ
		|						ВТ_ДвиженияПоКонвейеру КАК ВТ_ДвиженияПоКонвейеру)) КАК ПравилаАвтоматическойУстановкиКонсерновСрезПоследних
		|		ПО ВТ_ДвиженияПоКонвейеру.ТочкаРегистрации = ПравилаАвтоматическойУстановкиКонсерновСрезПоследних.ТочкаРегистрацииMES
		|			И (ПравилаАвтоматическойУстановкиКонсерновСрезПоследних.Действует
		|				ИЛИ ВТ_ДвиженияПоКонвейеру.Заказ = ПравилаАвтоматическойУстановкиКонсерновСрезПоследних.ПоследнийЗаказ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыИПравила.ДвижениеПоКонвейеру КАК ДвижениеПоКонвейеру,
		|	ВТ_ЗаказыИПравила.Правило КАК Правило,
		|	ВТ_ЗаказыИПравила.Заказ КАК Заказ,
		|	ВТ_ЗаказыИПравила.Правило.ФормулаПрименимости КАК ФормулаПрименимости
		|ИЗ
		|	ВТ_ЗаказыИПравила КАК ВТ_ЗаказыИПравила
		|ИТОГИ ПО
		|	ДвижениеПоКонвейеру
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыИПравила.Правило КАК Правило,
		|	ВТ_ЗаказыИПравила.Заказ КАК Заказ,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ИнспектируемыйЭлемент КАК ИнспектируемыйЭлемент,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ВариантИспользованияИнспектируемогоЭлемента КАК ВариантИспользованияИнспектируемогоЭлемента,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.Дефект КАК Дефект,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ПозицияA КАК ПозицияA,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ПозицияB КАК ПозицияB,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ПозицияC КАК ПозицияC,
		|	ПравилоАвтоматическойУстановкиКонсерновКонсерны.ТочкаПроверкиКачества КАК ТочкаПроверкиКачества
		|ИЗ
		|	ВТ_ЗаказыИПравила КАК ВТ_ЗаказыИПравила
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПравилоАвтоматическойУстановкиКонсернов.Консерны КАК ПравилоАвтоматическойУстановкиКонсерновКонсерны
		|		ПО ВТ_ЗаказыИПравила.Правило = ПравилоАвтоматическойУстановкиКонсерновКонсерны.Ссылка";
	
	Запрос.УстановитьПараметр("Узел", НастройкаОбмена.УзелРегистрацииИзменений);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКонсернов = РезультатыЗапроса[4].Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
				
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СоответствуетФормулеПрименимости = Справочники.ИнспектируемыеЭлементы.ВычислитьФормулуПрименимости(
					ВыборкаДетальныеЗаписи.ФормулаПрименимости,
					ВыборкаДетальныеЗаписи.Заказ);
				
				Если СоответствуетФормулеПрименимости Тогда
					
					СтрокиКонсернов = ТаблицаКонсернов.НайтиСтроки(Новый Структура("Правило, Заказ",
						ВыборкаДетальныеЗаписи.Правило, ВыборкаДетальныеЗаписи.Заказ));
						
					Для каждого ТекСтрока Из СтрокиКонсернов Цикл
						ДокОбъект = Документы.ОперацияПоКачеству.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(ДокОбъект, ТекСтрока);
						ДокОбъект.Дата = ТекущаяДатаСеанса();
						ДокОбъект.ОперацияКачества = Перечисления.ОперацииКачества.Проверка;
						ДокОбъект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
						ДокОбъект.АвторДата = ТекущаяДатаСеанса();
						ДокОбъект.ПравилоАвтоматическойУстановки = ТекСтрока.Правило;
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
						КоличествоКонсернов = КоличествоКонсернов + 1;
					КонецЦикла;
						
				КонецЕсли;
				
			КонецЦикла;
			
			СписокВыгруженыхОбъектов.Добавить(Выборка.ДвижениеПоКонвейеру);
				
			Если ТранзакцияАктивна() Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = СтрШаблон("Не удалось создать консерн по заказу %1", Выборка.ДвижениеПоКонвейеру.Заказ);
			РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие,
				Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	НетиповыеОбмены.ЗарегистрироватьВыгрузкуОбъектовИзПланаОбмена(НастройкаОбмена.Ссылка, СписокВыгруженыхОбъектов);
	
	ТекстСообщения = СтрШаблон("Создано %1 операций по качеству", КоличествоКонсернов);
	РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие, 
		Перечисления.СОЛЛЕРС_УровниСобытия.Информация,
		ТекстСообщения);
	
	Возврат ТекстСообщения;
	
КонецФункции
